import csv
import os

def write_data(file_name, data):

    with open(file_name, 'a', newline='') as csvfile:
#        fieldnames = ['first_name', 'last_name']
        fieldnames = [
            'index', '체결시간(HHMMSS)', '체결가', '전일대비', '등락율',
            '최우선매도호가', '최우선매수호가', '체결량', '누적체결량', '누적거래대금',
            '시가', '고가', '저가', '전일대비기호', '전일거래량대비(계약,주)',
            '거래대금증감', '전일거래량대비(비율)', '거래회전율', '거래비용', '체결강도',
            '시가총액(억)', '장구분', 'KO접근도', '누적거래량', '호가시간',
            '예상체결가', '예상체결수량', '매도호가1', '매도호가2', '매도호가3',
            '매도호가4', '매도호가5', '매도호가6', '매도호가7', '매도호가8',
            '매도호가9', '매도호가10', '매수호가1', '매수호가2', '매수호가3',
            '매수호가4', '매수호가5', '매수호가6', '매수호가7', '매수호가8',
            '매수호가9', '매수호가10', '매도호가수량1', '매도호가수량2', '매도호가수량3',
            '매도호가수량4', '매도호가수량5', '매도호가수량6', '매도호가수량7', '매도호가수량8',
            '매도호가수량9', '매도호가수량10', '매수호가수량1', '매수호가수량2', '매수호가수량3',
            '매수호가수량4', '매수호가수량5', '매수호가수량6', '매수호가수량7', '매수호가수량8',
            '매수호가수량9', '매수호가수량10', '매도호가직전대비1', '매도호가직전대비2', '매도호가직전대비3',
            '매도호가직전대비4', '매도호가직전대비5', '매도호가직전대비6', '매도호가직전대비7', '매도호가직전대비8',
            '매도호가직전대비9', '매도호가직전대비10', '매수호가직전대비1', '매수호가직전대비2', '매수호가직전대비3',
            '매수호가직전대비4', '매수호가직전대비5', '매수호가직전대비6', '매수호가직전대비7', '매수호가직전대비8',
            '매수호가직전대비9', '매수호가직전대비10', '매도호가총잔량', '매도호가총잔량직전대비', '매수호가총잔량',
            '매수호가총잔량직전대비', '순매수잔량', '매수비율', '순매도잔량', '매도비율',
            '예상체결가전일종가대비', '예상체결가전일종가대비등락율', '장운영구분', '투자자별ticker', '예상체결가전일종가대비기호',
            '예상체결량', '예상체결가전일대비기호', '예상체결가전일대비', '예상체결가전일대비등락율', '전일거래량대비예상체결률']

        writer = csv.DictWriter(csvfile, fieldnames=fieldnames)

        file_size = os.stat(file_name).st_size

        if file_size == 0:
            writer.writeheader()

        writer.writerow(data)

if __name__ == "__main__":

    file_name = "093370.csv"
    csv_file = open("/home/kyungwoo.hur/Downloads/" + file_name, "r", encoding='UTF8')
    csv_reader = csv.DictReader(csv_file)

    for csv_data in csv_reader:

        current_time = csv_data['index']

        target_filename = current_time[:10] + ".csv"

        write_data(target_filename, csv_data)

